Revit 2027 API
IMemberForcesServer Interface
 Interface for the Member Forces server to implement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IMemberForcesServer : IExternalServer
Public Interface IMemberForcesServer
	Inherits IExternalServer
public interface class IMemberForcesServer : IExternalServer
type IMemberForcesServer =
    interface
        interface IExternalServer
    end
The IMemberForcesServer type exposes the following members.
Methods
Name | Description
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
MemberForcesUpdate |  The server's method that will be called when Revit User clicks Member Forces button in the MPP.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace